In [2]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [3]:
%%sql 
drop table if exists Students;
drop table if exists Specialities;

CREATE TABLE Specialities
(
    id integer primary key, 
    Name varchar(50)
);

 * sqlite://
Done.
Done.
Done.

[]

In [4]:
%sql select * from Specialities

 * sqlite://
Done.

[]

In [5]:
%%sql
insert Into Specialities(id, name) values (1, 'Биотехнические системы и технологии');
insert Into Specialities(id, name) values (2, 'Компьютерная безопасность');
insert Into Specialities(id, name) values (3, 'Прикладная математика и информатика');
insert Into Specialities(id, name) values (4, 'Мехатроника и робототехника');
insert Into Specialities(id, name) values (5, 'Системный анализ и управление');
insert Into Specialities(id, name) values (6, 'Информационная безопасность телекоммуникационных систем');
insert Into Specialities(id, name) values (7, 'Управление в технических системах');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite://
Done.

[]

In [7]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50),
    Speciality_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(Speciality_id) references Specialities(id)
);

 * sqlite://
Done.
Done.

[]

In [8]:
%sql select * from Students

 * sqlite://
Done.

[]

In [9]:
%%sql
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (1, 'Альянов', 'Николай', 1, '04-20', 3.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (2, 'Крыгина', 'Ева', 1, '01-20', 4.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (3, 'Исаева', 'Анна', 1, '01-20', 4.75);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (4, 'Егоров', 'Павел', 2, '01-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (5, 'Тихомиров', 'Тимофей', 2, '03-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (6, 'Ширшов', 'Александр', 2, '06-20', 3.91);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (7, 'Фатеев', 'Максим', 3, '05-20', 3.8);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (8, 'Киселев', 'Петр',  3, '05-20', 3.5);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (9, 'Агашкина', 'Дарья', 4, '02-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (10, 'Горин', 'Олег', 5, '01-20', 3.89);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (11, 'Комарова', 'Виктория', 6, '02-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (12, 'Челыхов', 'Иван', 6, '06-20', 4.45);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (13, 'Назаров', 'Александр', 6, '06-20', 3.73);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (14, 'Горлова', 'Ксения', 7, '01-20', 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%sql select * from Students

 * sqlite://
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Виктория', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

In [11]:
%sql select * from Specialities

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии'),
 (2, 'Компьютерная безопасность'),
 (3, 'Прикладная математика и информатика'),
 (4, 'Мехатроника и робототехника'),
 (5, 'Системный анализ и управление'),
 (6, 'Информационная безопасность телекоммуникационных систем'),
 (7, 'Управление в технических системах')]

In [15]:
%sql select * from Students where (Name = "Александр")

 * sqlite://
Done.

[(6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73)]

In [39]:
%sql select distinct Specialities.Name from Students join Specialities on (Students.Speciality_id = Specialities.id) where (students.GPA >= 4)

 * sqlite://
Done.

[('Биотехнические системы и технологии',),
 ('Компьютерная безопасность',),
 ('Мехатроника и робототехника',),
 ('Информационная безопасность телекоммуникационных систем',),
 ('Управление в технических системах',)]

In [24]:
%sql select * from Students where ((SecondName LIKE "К%" OR SecondName LIKE "к%") AND (SecondName LIKE "%е%" OR SecondName LIKE "%Е%"))

 * sqlite://
Done.

[(8, 'Петр', 'Киселев', 3, '05-20', 3.5)]

In [37]:
%sql SELECT specialities.Name, AVG(Students.GPA) as GPA FROM Specialities, Students  WHERE Specialities.id = Students.Speciality_id GROUP BY Students.Speciality_id HAVING count(DISTINCT Students.StudyGroup) > 1

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334),
 ('Компьютерная безопасность', 4.306666666666667),
 ('Информационная безопасность телекоммуникационных систем', 4.336666666666667)]

In [58]:
%%sql SELECT spec.Name, AVG(students.GPA) as GPA 
FROM Specialities as spec, Students as students
WHERE (spec.id = students.Speciality_id AND students.SecondName NOT LIKE '_а%')
GROUP BY students.Speciality_id 
HAVING (count(students.student_id) >= 2)

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334),
 ('Компьютерная безопасность', 4.306666666666667),
 ('Информационная безопасность телекоммуникационных систем', 4.640000000000001)]